#include<iostream>
using namespace std;
void caidan()
{
    cout<<"\033[34m欢迎使用手机通讯录!\033[0m"<<endl;
    cout << "\033[31m" << R"(
                 _             _       
  ___ ___  _ __ | |_ __ _  ___| |_ ___ 
 / __/ _ \| '_ \| __/ _` |/ __| __/ __|
| (_| (_) | | | | || (_| | (__| |_\__ \
 \___\___/|_| |_|\__\__,_|\___|\__|___/
                                       )" << "\033[0m" <<endl;
    cout<<"处理业务请键入对应数字"<<endl;
    cout<<"\033[33m******1.添加联系人******\033[0m"<<endl;
    cout<<"\033[33m******2.显示联系人******\033[0m"<<endl;
    cout<<"\033[33m******3.删除联系人******\033[0m"<<endl;
    cout<<"\033[33m******4.找查联系人******\033[0m"<<endl;
    cout<<"\033[33m******5.修改联系人******\033[0m"<<endl;
    cout<<"\033[33m******6.清空联系人******\033[0m"<<endl;
    cout<<"\033[33m******0.退出通讯录******\033[0m"<<endl;
}